src/cf/InformationRegisters/РезультатыПроверкиКМРазрешительныйРежимМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РезультатыПроверкиКМРазрешительныйРежимМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДетальныйРезультатПроверкиКМ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументКонтроляКМРазрешительныйРежимМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерУпаковки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерУпаковкиМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/СобытияФормРазрешительныйРежимМДЛП/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ОбработчикиСобытийФормы

// Обработчик события формы объекта, подключенной к механизму проверки КМ.
//
Процедура ПриЧтенииНаСервере(Форма, ТекущийОбъект) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	СобытияФормРазрешительныйРежимМДЛППереопределяемый.ПриЧтенииНаСервере(Форма, ТекущийОбъект, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект")
		   И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "Ссылка") Тогда
			
			ПолучитьРезультатыПроверкиКМНаФормеПоУмолчанию(Форма);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события формы объекта, подключенной к механизму проверки КМ.
//
Процедура ПриЗаписиНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	СобытияФормРазрешительныйРежимМДЛППереопределяемый.ПриЗаписиНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект")
		   И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "Ссылка") Тогда
			
			ЗаписатьРезультатыПроверкиКМНаФормеПоУмолчанию(Форма, ТекущийОбъект);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события формы объекта, подключенной к механизму проверки КМ.
//
Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	СобытияФормРазрешительныйРежимМДЛППереопределяемый.ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект")
		   И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "Ссылка") Тогда
			
			ПолучитьРезультатыПроверкиКМНаФормеПоУмолчанию(Форма);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ЗаписьРезультатовПроверкиКМ

// Возвращает параметры, необходимые для записи результата проверки КМ.
//
// Возвращаемое значение:
//  ВозвращаемоеЗначение - Структура - параметры, необходимые для записи результата проверки КМ.
//   * ТаблицаРезультатовПроверкиКМ - ТаблицаЗначений - таблица записываемых результатов проверки КМ.
//      * Документ            - ДокументыСсылка - документ, к которому подключен механизм проверки.
//      * НомерУпаковки       - SGTIN
//      * РезультатПроверкиКМ - ФиксированнаяСтруктура - результат проверки КМ
//                              (см. РегистрыСведений.РезультатыПроверкиКМРазрешительныйРежимМДЛП.ВсеСвойстваРезультатаПроверкиКМ).
//
Функция ПараметрыЗаписиРезультатовПроверкиКМ() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ТаблицаРезультатов = Новый ТаблицаЗначений;
	ТаблицаРезультатов.Колонки.Добавить("Документ", Метаданные.ОпределяемыеТипы.ДокументКонтроляКМРазрешительныйРежимМДЛП.Тип);
	ТаблицаРезультатов.Колонки.Добавить("НомерУпаковки", Метаданные.ОпределяемыеТипы.НомерУпаковкиМДЛП.Тип);
	ТаблицаРезультатов.Колонки.Добавить("РезультатПроверкиКМ", Новый ОписаниеТипов("ФиксированнаяСтруктура"));
	
	ВозвращаемоеЗначение.Вставить("ТаблицаРезультатовПроверкиКМ", ТаблицаРезультатов);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Выполняет запись результатов проверки КМ.
//
// Параметры:
//  Параметры - Структура - см. ПараметрыЗаписиРезультатовПроверкиКМ.
//
Процедура ЗаписатьРезультатыПроверкиКМ(Параметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Параметры.ТаблицаРезультатовПроверкиКМ) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаписиРезультатовПроверкиКМ = ПараметрыЗаписиРезультатовПроверкиКМ();
	ЗаполнитьЗначенияСвойств(ПараметрыЗаписиРезультатовПроверкиКМ, Параметры);
	
	СтандартнаяОбработка = Истина;
	
	СобытияФормРазрешительныйРежимМДЛППереопределяемый.ЗаписатьРезультатыПроверкиКМ(ПараметрыЗаписиРезультатовПроверкиКМ, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		РегистрыСведений.РезультатыПроверкиКМРазрешительныйРежимМДЛП.ЗаписатьРезультатыПроверкиКМ(ПараметрыЗаписиРезультатовПроверкиКМ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ЗаписьРезультатовПроверкиКМ

#Область ПолучениеЗаписанныхРезультатовПроверкиКМ

// Возвращает параметры, необходимые для получения записанных результатов проверки КМ.
//
// Возвращаемое значение:
//  ВозвращаемоеЗначение - Структура - параметры, необходимые для получения результата проверки КМ.
//    * Документ                     - Ссылка на документ, к которому подключен механизм проверки.
//    * НомераУпаковок               - Не обязательный. Массив номеров упаковок.
//
Функция ПараметрыПолученияРезультатовПроверкиКМ() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Документ", Неопределено);
	ВозвращаемоеЗначение.Вставить("НомераУпаковок", Новый Массив);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Выполняет получение записанных результатов проверки КМ.
//
// Параметры:
//  Параметры - Структура - см. ПараметрыПолученияРезультатовПроверкиКМ.
//
Функция ПолучитьРезультатыПроверкиКМ(Параметры) Экспорт
	
	ПараметрыПолученияРезультатовПроверкиКМ = ПараметрыПолученияРезультатовПроверкиКМ();
	ЗаполнитьЗначенияСвойств(ПараметрыПолученияРезультатовПроверкиКМ, Параметры);
	
	ТаблицаРезультатовПроверкиКМ = РегистрыСведений.РезультатыПроверкиКМРазрешительныйРежимМДЛП.ПолучитьРезультатыПроверкиКМ(ПараметрыПолученияРезультатовПроверкиКМ);
	
	СобытияФормРазрешительныйРежимМДЛППереопределяемый.ПолучитьРезультатыПроверкиКМ(ПараметрыПолученияРезультатовПроверкиКМ, ТаблицаРезультатовПроверкиКМ);
	
	Возврат ТаблицаРезультатовПроверкиКМ;
	
КонецФункции

#КонецОбласти // ПолучениеЗаписанныхРезультатовПроверкиКМ

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьРезультатыПроверкиКМНаФормеПоУмолчанию(Форма, ТекущийОбъект)
	
	Если Не Форма.Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	
	ПараметрыЗаписи = ПараметрыЗаписиРезультатовПроверкиКМ();
	
	Для Каждого СтрокаНомераУпаковки Из Объект.НомераУпаковок Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаНомераУпаковки.РезультатПроверкиКМРазрешительныйРежим) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРезультата = ПараметрыЗаписи.ТаблицаРезультатовПроверкиКМ.Добавить();
		СтрокаРезультата.Документ            = ТекущийОбъект.Ссылка;
		СтрокаРезультата.НомерУпаковки       = СтрокаНомераУпаковки.НомерКИЗ;
		СтрокаРезультата.РезультатПроверкиКМ = СтрокаНомераУпаковки.РезультатПроверкиКМРазрешительныйРежим;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаписи.ТаблицаРезультатовПроверкиКМ) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьРезультатыПроверкиКМ(ПараметрыЗаписи);
	
КонецПроцедуры

Процедура ПолучитьРезультатыПроверкиКМНаФормеПоУмолчанию(Форма)
	
	Объект = Форма.Объект;
	
	ПараметрыПолучения = ПараметрыПолученияРезультатовПроверкиКМ();
	ПараметрыПолучения.Документ = Объект.Ссылка;
	
	ТаблицаРезультатовПроверкиКМ = ПолучитьРезультатыПроверкиКМ(ПараметрыПолучения);
	Если Не ЗначениеЗаполнено(ТаблицаРезультатовПроверкиКМ) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНомераУпаковки Из Объект.НомераУпаковок Цикл
		
		СтрокиРезультатовПроверкиКМ = ТаблицаРезультатовПроверкиКМ.НайтиСтроки(Новый Структура("НомерУпаковкиПроверки", СтрокаНомераУпаковки.НомерКИЗ));
		Если СтрокиРезультатовПроверкиКМ.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаНомераУпаковки.РезультатПроверкиКМРазрешительныйРежим = СтрокиРезультатовПроверкиКМ[0].РезультатПроверкиКМ;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
